---
kind: property
id: P:Autodesk.Revit.DB.WorksetFilter.IncludeStandaloneWorksetsOnly
source: html/7e636a4d-7b22-1100-9527-5cbf82c5d0e1.htm
---
# Autodesk.Revit.DB.WorksetFilter.IncludeStandaloneWorksetsOnly Property

True if the results of the filter only match stand-alone worksets; worksets that are not stand-alone will be rejected.

## Syntax (C#)
```csharp
public bool IncludeStandaloneWorksetsOnly { get; set; }
```